In [4]:
import py_entitymatching as em
import pandas as pd
import os

In [32]:
ltable = em.read_csv_metadata('./ltable.csv', encoding = "ISO-8859-1", key = 'ltable_id')

Metadata file is not present in the given path; proceeding to read the csv file.

In [33]:
rtable = em.read_csv_metadata('./rtable.csv', encoding = "ISO-8859-1", key = 'rtable_id')

Metadata file is not present in the given path; proceeding to read the csv file.

In [23]:
sample = em.read_csv_metadata('./sample_submission.csv')

Metadata file is not present in the given path; proceeding to read the csv file.

In [24]:
train = em.read_csv_metadata('./train.csv')

Metadata file is not present in the given path; proceeding to read the csv file.

In [25]:
test = em.read_csv_metadata('./test.csv')

Metadata file is not present in the given path; proceeding to read the csv file.

In [34]:
ltable.head()

,ltable_id,title,category,brand,modelno,price
0,0,draper infrared remote transmitter,electronics - general,draper,121066,58.45
1,1,epson 1500 hours 200w uhe projector lamp elplp12,monitors,epson,elplp12,438.84
2,2,comprehensive two-piece 75 precision bnc jack for rg-59 set of 25,tv accessories,comprehensive,bj-2c7559,59.25
3,3,d-link dcs-1100 network camera,garden - general,d-link,dcs-1100,99.82
4,4,startech.com rkpw247015 24 outlet power strip,electronics - general,startech,rkpw247015,59.00

In [35]:
rtable.head()

,rtable_id,title,category,brand,modelno,price
0,0,koss eq50 3-band stereo equalizer,headphone accessories,koss,152132,12.65
1,1,kodak black ink cartridge 10b 1163641,inkjet printer ink,kodak,1163641,10.28
2,2,kingston 128mx64 pc2700 compaq evo d320 ktc-d320 1g,computers accessories,kingston,ktc-d320 / 1g,33.75
3,3,kinamax ms-ues2 mini high precision usb 3-button 3d optical scroll wheel mouse with retractable ...,mice,kinamax,ms-ues2,6.99
4,4,kensington k72349us wireless mouse for netbooks,mice,kensington,k72349us,24.00

In [36]:
sample.head()

   id  label
0   0      0
1   8      0
2   9      1
3  10      1
4  15      1

In [37]:
train.head()

   ltable_id  rtable_id  label  id
0        621       3167      0   1
1       2115       8789      0   2
2        278       9064      0   3
3       1673      13279      0   4
4       2305       2948      0   5

In [38]:
test.head()

   ltable_id  rtable_id  id
0       1853       2139   0
1       1718      11835   8
2       1624       5013   9
3        614       5969  10
4       1512      19684  15

In [39]:
# Display the keys of the input tables
em.get_key(ltable), em.get_key(rtable)

('ltable_id', 'rtable_id')

In [40]:
print('Number of tuples in ltable: ' + str(len(ltable)))
print('Number of tuples in rtable: ' + str(len(rtable)))
print('Number of tuples in ltable X rtable (i.e the cartesian product): ' + str(len(ltable)*len(rtable)))

Number of tuples in ltable: 2554
Number of tuples in rtable: 22074
Number of tuples in ltable X rtable (i.e the cartesian product): 56376996